#+TITLE: Test Suite for Headlines


#+BEGIN_COMMENT :description Expected Scopes & Capture Groups:

* === Block Scopes ===
# The following scopes are applied to the entire headline.
- markup.heading.org
- heading.1.org, heading.2.org, etc.

* === Capture Group Scopes ===
# The following scopes are applied to the specific parts of the headline.
1. stars -> punctuation.definition.heading.org
2. todo -> keyword.other.todo.org
3. priority block -> constant.other.priority.org
4. priority letter -> constant.other.priority.value.org
5. headline text -> entity.name.section.org
6. progress/cookie -> constant.other.progress.org
7. tags -> entity.name.tag.org
#+END_COMMENT

* Normal Cases

#+NAME: Simple headline (Level 1)
#+BEGIN_SRC org
* Simple headline
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value  |
|---------+-----------------|
| 1       | *               |
| 5       | Simple headline |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value    |
|---------+-------------------|
| 1       | * Simple headline |

#+NAME: Complete headline with all elements
#+BEGIN_SRC org
* TODO [#A] Complete headline example [2/5] :work:project:
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value            |
|---------+---------------------------|
| 1       | *                         |
| 2       | TODO                      |
| 3       | [#A]                      |
| 4       | A                         |
| 5       | Complete headline example |
| 6       | [2/5]                     |
| 7       | :work:project:            |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                                          |
|---------+---------------------------------------------------------|
| 1       | * TODO [#A] Complete headline example [2/5] :work:project: |

#+NAME: Multi-level headline with TODO (Level 2)
#+BEGIN_SRC org
** DONE Multi-level task
#+END_SRC
#+RESULTS: headlineLevel2Regex
| Group # | Expected Value   |
|---------+------------------|
| 1       | **               |
| 2       | DONE             |
| 5       | Multi-level task |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value          |
|---------+-------------------------|
| 1       | ** DONE Multi-level task |

#+NAME: Priority without TODO (Level 3)
#+BEGIN_SRC org
*** [#B] Priority headline without todo
#+END_SRC
#+RESULTS: headlineLevel3Regex
| Group # | Expected Value                 |
|---------+--------------------------------|
| 1       | ***                            |
| 3       | [#B]                           |
| 4       | B                              |
| 5       | Priority headline without todo |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                           |
|---------+------------------------------------------|
| 1       | *** [#B] Priority headline without todo |

#+NAME: Complex headline with unicode and symbols (Level 4)
#+BEGIN_SRC org
**** WAITING [#C] 复杂标题 with symbols !@#$% :chinese:symbols:
#+END_SRC
#+RESULTS: headlineLevel4Regex
| Group # | Expected Value              |
|---------+-----------------------------|
| 1       | ****                        |
| 2       | WAITING                     |
| 3       | [#C]                        |
| 4       | C                           |
| 5       | 复杂标题 with symbols !@#$% |
| 7       | :chinese:symbols:           |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                                                  |
|---------+-----------------------------------------------------------------|
| 1       | **** WAITING [#C] 复杂标题 with symbols !@#$% :chinese:symbols: |

#+NAME: Level 5 headline
#+BEGIN_SRC org
***** A level 5 headline
#+END_SRC
#+RESULTS: headlineLevel5Regex
| Group # | Expected Value       |
|---------+----------------------|
| 1       | *****                |
| 5       | A level 5 headline   |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value           |
|---------+--------------------------|
| 1       | ***** A level 5 headline |

#+NAME: Very deep level headline (Level 6)
#+BEGIN_SRC org
****** NEXT [#A] Deep level headline :deep:level:nested:
#+END_SRC
#+RESULTS: headlineLevel6Regex
| Group # | Expected Value        |
|---------+-----------------------|
| 1       | ******                |
| 2       | NEXT                  |
| 3       | [#A]                  |
| 4       | A                     |
| 5       | Deep level headline   |
| 7       | :deep:level:nested:   |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                                          |
|---------+---------------------------------------------------------|
| 1       | ****** NEXT [#A] Deep level headline :deep:level:nested: |

#+NAME: Headline with too many stars (7)
#+BEGIN_SRC org
******* Too many stars
#+END_SRC
#+RESULTS: headlineLevel6Regex
| Group # | Expected Value   |
|---------+------------------|
| 1       | *******          |
| 5       | Too many stars   |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value         |
|---------+------------------------|
| 1       | ******* Too many stars |

* Edge Cases

#+NAME: No space after stars
#+BEGIN_SRC org
*TODO No space
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match
#+RESULTS: headlineDetectRegex
no-match

#+NAME: Multiple spaces between elements
#+BEGIN_SRC org
*    TODO    Headline    :tag:
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 2       | TODO           |
| 5       | Headline       |
| 7       | :tag:          |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                  |
|---------+---------------------------------|
| 1       | *    TODO    Headline    :tag: |

#+NAME: Multiple priorities
#+BEGIN_SRC org
* [#A][#B] Task
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 3       | [#A]           |
| 4       | A              |
| 5       | [#B] Task      |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value       |
|---------+----------------------|
| 1       | * [#A][#B] Task |

#+NAME: Headline with only stars
#+BEGIN_SRC org
*
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match

#+RESULTS: headlineDetectRegex
no-match

#+NAME: Headline with only tags
#+BEGIN_SRC org
* :tag1:
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 7       | :tag1:         |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value |
|---------+----------------|
| 1       | * :tag1:       |

#+NAME: Duplicate tags
#+BEGIN_SRC org
* Task :tag1:tag1:
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 5       | Task           |
| 7       | :tag1:tag1:    |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value      |
|---------+---------------------|
| 1       | * Task :tag1:tag1: |

#+NAME: Tag with special characters
#+BEGIN_SRC org
* Task :tag$:@:tag!:
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 5       | Task           |
| 7       | :tag$:@:tag!:  |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value        |
|---------+-----------------------|
| 1       | * Task :tag$:@:tag!: |

#+NAME: Timestamp in headline text
#+BEGIN_SRC org
* Task <2025-08-01 Fri>
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value        |
|---------+-----------------------|
| 1       | *                     |
| 5       | Task <2025-08-01 Fri> |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value              |
|---------+-----------------------------|
| 1       | * Task <2025-08-01 Fri> |

#+NAME: Headline with inline markup
#+BEGIN_SRC org
* Headline /italic/ *bold* =code=
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value                 |
|---------+--------------------------------|
| 1       | *                              |
| 5       | Headline /italic/ *bold* =code= |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value                       |
|---------+--------------------------------------|
| 1       | * Headline /italic/ *bold* =code= |

#+NAME: Malformed progress cookie
#+BEGIN_SRC org
* Project [abc%]
#+END_SRC
#+RESULTS: headlineLevel1Regex
| Group # | Expected Value |
|---------+----------------|
| 1       | *              |
| 5       | Project [abc%] |
#+RESULTS: headlineDetectRegex
| Group # | Expected Value       |
|---------+----------------------|
| 1       | * Project [abc%] |

* Non-Matching Cases

#+NAME: Not a headline - no leading star
#+BEGIN_SRC org
This is not a headline.
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match
#+RESULTS: headlineDetectRegex
no-match

#+NAME: Not a headline - star not at beginning of line
#+BEGIN_SRC org
  * This is not a headline.
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match
#+RESULTS: headlineDetectRegex
no-match

#+NAME: Not a headline - list item
#+BEGIN_SRC org
- * This is a list item
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match
#+RESULTS: headlineDetectRegex
no-match

#+NAME: Not a headline - escaped star
#+BEGIN_SRC org
\* This is not a headline
#+END_SRC
#+RESULTS: headlineLevel1Regex
no-match
#+RESULTS: headlineDetectRegex
no-match
